tests/contract/cases/cavity/system/controlDict
// SPDX-License-Identifier: GPL-3.0-or-later
// Copyright (C) 2026 Joern Ihlenburg
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      controlDict;
}

application     icoFoam;

startFrom       startTime;
startTime       0;
stopAt          endTime;
endTime         0.05;
deltaT          0.005;

writeControl    timeStep;
writeInterval   10;
purgeWrite      1;
writeFormat     ascii;
writePrecision  12;
timeFormat      general;
timePrecision   6;

runTimeModifiable no;
